nkpkm2/stm32-stream-lab/firmware/acquisition/r2_w5_capacity.c
#include "r2_w5_capacity.h"

#include "main.h"
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "stm32f4xx_hal_dma_ex.h"

#include <stddef.h>
#include <stdint.h>

extern ADC_HandleTypeDef hadc1;
extern DMA_HandleTypeDef hdma_adc1;
extern TIM_HandleTypeDef htim2;

#define W5_MAGIC 0x52325735U
#define W5_CONTROL_STACK_WORDS 768U
#define W5_PROCESS_STACK_WORDS 768U
#define W5_DMA_ERRORS (DMA_LISR_TEIF0 | DMA_LISR_DMEIF0 | DMA_LISR_FEIF0)
#define W5_ALL_FLAGS (W5_DMA_ERRORS | DMA_LISR_TCIF0 | DMA_LISR_HTIF0)
#define W5_GUARD_LO 0x13579BDFU
#define W5_GUARD_HI 0x2468ACE0U
#define W5_SENTINEL 0xA55AU
#define W5_RUN_TIMEOUT_MS 1000U
#define W5_DRAIN_TIMEOUT_MS 500U
#define W5_SETTLE_CYCLES 1200U
#define W5_DMA_REQUIRED_CR 0x00062D17U
#define W5_ADC_REQUIRED_CR2 0x16000701U
#define W5_WORK_BIT (1UL << 0)
#define W5_ALL_BUFFER_MASK ((1UL << R2_W5_BUFFERS) - 1UL)

typedef struct
{
    volatile uint32_t guard_lo;
    volatile uint16_t samples[R2_W5_BLOCK_SAMPLES];
    volatile uint32_t guard_hi;
} W5_Buffer;

typedef struct
{
    uint32_t sequence;
    R2_BufferId buffer_id;
    uint32_t completed_slot;
    uint32_t mapping_epoch;
} W5_BlockDescriptor;

typedef enum
{
    W5_FREE_SEND_NONE = 0,
    W5_FREE_SEND_INIT,
    W5_FREE_SEND_COMPLETE
} W5_FreeSendSource;

typedef struct
{
    volatile uint32_t active;
    volatile uint32_t source;
    volatile uint32_t sequence;
    volatile R2_BufferId buffer_id;
    volatile uint32_t hook_seen;
} W5_FreeSendContext;

static W5_Buffer buffers[R2_W5_BUFFERS] __attribute__((aligned(4)));
static StaticTask_t control_task_control;
static StaticTask_t processing_task_control;
static StackType_t control_task_stack[W5_CONTROL_STACK_WORDS];
static StackType_t processing_task_stack[W5_PROCESS_STACK_WORDS];
static TaskHandle_t processing_task_handle;

static StaticQueue_t free_queue_control;
static StaticQueue_t ready_queue_control;
static uint8_t free_queue_storage[R2_W5_K * sizeof(R2_BufferId)];
static uint8_t ready_queue_storage[R2_W5_K * sizeof(W5_BlockDescriptor)];
static QueueHandle_t free_queue;
static QueueHandle_t ready_queue;

static volatile uint32_t free_token_mask;
static volatile uint32_t ready_token_mask;
static volatile BaseType_t irq_should_yield;
static uint32_t irq_flags;
static uint32_t irq_ct;
static uint32_t irq_enter_cycle;
static uint32_t trace_for_exit;
static W5_FreeSendContext free_send_context;

volatile R2_W5_Result g_r2_w5_result;

static uint32_t Address(uint32_t id)
{
    return (uint32_t)(uintptr_t)&buffers[id].samples[0];
}

static uint32_t BitFor(R2_BufferId id)
{
    return 1UL << (uint32_t)id;
}

static uint32_t CurrentCt(void)
{
    return (DMA2_Stream0->CR & DMA_SxCR_CT) != 0U ? 1U : 0U;
}

static void DisableDmaInterrupts(void)
{
    CLEAR_BIT(DMA2_Stream0->CR,
        DMA_SxCR_TCIE | DMA_SxCR_HTIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE);
    CLEAR_BIT(DMA2_Stream0->FCR, DMA_SxFCR_FEIE);
}

static void LatchFault(uint32_t bits)
{
    g_r2_w5_result.fault_bits |= bits;
    g_r2_w5_result.test_pass = 0U;
    if (g_r2_w5_result.phase != R2_W5_COMPLETE)
    {
        g_r2_w5_result.phase = R2_W5_QUIESCING;
    }
    CLEAR_BIT(TIM2->CR1, TIM_CR1_CEN);
    DisableDmaInterrupts();
    __DSB();
}

static uint32_t HardwareHealthy(void)
{
    uint32_t errors = DMA2->LISR & W5_DMA_ERRORS;
    uint32_t ovr = ADC1->SR & ADC_SR_OVR;

    g_r2_w5_result.dma_error_flags_seen |= errors;
    g_r2_w5_result.adc_ovr_seen |= ovr;

    return (errors == 0U) &&
        (ovr == 0U) &&
        ((DMA2_Stream0->CR & ~DMA_SxCR_CT) == W5_DMA_REQUIRED_CR) &&
        ((TIM2->CR1 & TIM_CR1_CEN) != 0U) &&
        (ADC1->CR2 == W5_ADC_REQUIRED_CR2);
}

static void LedgerFault(void)
{
    ++g_r2_w5_result.token_ledger_errors;
    LatchFault(R2_W5_FAULT_TOKEN_LEDGER);
}

void R2_W5_TraceQueueSend(void *queue_handle)
{
    R2_BufferState state;
    uint32_t bit;
    R2_BufferId id;

    if (queue_handle != (void *)free_queue)
    {
        return;
    }

    if (free_send_context.active == 0U)
    {
        ++g_r2_w5_result.illegal_free_send_count;
        LatchFault(R2_W5_FAULT_QUEUE_SOURCE);
        return;
    }

    id = free_send_context.buffer_id;
    if ((uint32_t)id >= R2_W5_BUFFERS)
    {
        ++g_r2_w5_result.illegal_free_send_count;
        LatchFault(R2_W5_FAULT_QUEUE_SOURCE);
        return;
    }

    bit = BitFor(id);
    if ((free_token_mask & bit) != 0U)
    {
        LedgerFault();
        return;
    }

    if (free_send_context.source == W5_FREE_SEND_INIT)
    {
        if ((R2_BufferPool_GetState(id, &state) != R2_BUFFER_POOL_OK) ||
            (state != R2_BUFFER_STATE_FREE) ||
            ((uint32_t)id < 2U))
        {
            ++g_r2_w5_result.illegal_free_send_count;
            LatchFault(R2_W5_FAULT_QUEUE_SOURCE);
            return;
        }
        free_token_mask |= bit;
        ++g_r2_w5_result.init_hook_count;
    }
    else if (free_send_context.source == W5_FREE_SEND_COMPLETE)
    {
        if ((R2_BufferPool_GetState(id, &state) != R2_BUFFER_POOL_OK) ||
            (state != R2_BUFFER_STATE_PROCESSING) ||
            (R2_BufferPool_ReleaseProcessing(id) != R2_BUFFER_POOL_OK))
        {
            ++g_r2_w5_result.illegal_free_send_count;
            LatchFault(R2_W5_FAULT_RELEASE);
            return;
        }
        free_token_mask |= bit;
        ++g_r2_w5_result.completion_hook_count;
        if ((free_send_context.sequence >= 1U) &&
            (free_send_context.sequence <= R2_W5_EVENTS))
        {
            g_r2_w5_result.trace[free_send_context.sequence - 1U]
                .release_commit_offset_cycles =
                DWT->CYCCNT - g_r2_w5_result.epoch_before;
        }
    }
    else
    {
        ++g_r2_w5_result.illegal_free_send_count;
        LatchFault(R2_W5_FAULT_QUEUE_SOURCE);
        return;
    }

    free_send_context.hook_seen = 1U;
}

static BaseType_t SendFreeToken(
    W5_FreeSendSource source,
    R2_BufferId id,
    uint32_t sequence)
{
    BaseType_t result;

    if ((free_queue == NULL) ||
        (free_send_context.active != 0U))
    {
        LatchFault(R2_W5_FAULT_QUEUE_SOURCE);
        return pdFAIL;
    }

