nkpkm2/stm32-stream-lab/firmware/acquisition/r2_w5_capacity.c
    free_send_context.active = 1U;
    free_send_context.source = (uint32_t)source;
    free_send_context.sequence = sequence;
    free_send_context.buffer_id = id;
    free_send_context.hook_seen = 0U;

    result = xQueueSend(free_queue, &id, 0U);

    if ((result != pdPASS) || (free_send_context.hook_seen == 0U))
    {
        if (source == W5_FREE_SEND_COMPLETE)
        {
            LatchFault(R2_W5_FAULT_RELEASE);
        }
        else
        {
            LatchFault(R2_W5_FAULT_QUEUE_SOURCE);
        }
    }

    free_send_context.active = 0U;
    free_send_context.source = W5_FREE_SEND_NONE;
    free_send_context.sequence = 0U;
    free_send_context.buffer_id = R2_BUFFER_POOL_INVALID_ID;
    free_send_context.hook_seen = 0U;

    return result;
}

void R2_W5_IrqEnter(uint32_t dma_lisr)
{
    irq_enter_cycle = DWT->CYCCNT;
    irq_flags = dma_lisr;
    irq_ct = CurrentCt();
    trace_for_exit = R2_W5_EVENTS;
    irq_should_yield = pdFALSE;
    ++g_r2_w5_result.irq_count;

    if (g_r2_w5_result.phase != R2_W5_RUNNING)
    {
        DisableDmaInterrupts();
        return;
    }

    g_r2_w5_result.dma_error_flags_seen |= dma_lisr & W5_DMA_ERRORS;
    g_r2_w5_result.adc_ovr_seen |= ADC1->SR & ADC_SR_OVR;

    if ((dma_lisr & W5_DMA_ERRORS) != 0U)
    {
        LatchFault(R2_W5_FAULT_DMA);
    }
    else if ((ADC1->SR & ADC_SR_OVR) != 0U)
    {
        LatchFault(R2_W5_FAULT_OVR);
    }
    else if ((dma_lisr & DMA_LISR_TCIF0) == 0U)
    {
        LatchFault(R2_W5_FAULT_EVENT);
    }
}

static void Completed(DMA_HandleTypeDef *dma, uint32_t completed_slot)
{
    uint32_t sequence;
    uint32_t bit;
    uint32_t active_address;
    uint32_t critical_start;
    uint32_t primask;
    uint32_t now;
    uint32_t elapsed;
    uint32_t nominal;
    uint32_t ct_after;
    uint32_t healthy;
    UBaseType_t free_depth;
    UBaseType_t ready_depth;
    BaseType_t hpw = pdFALSE;
    BaseType_t free_result;
    R2_BufferId replacement = R2_BUFFER_POOL_INVALID_ID;
    R2_BufferState replacement_owner;
    R2_BufferPoolSnapshot ownership_before;
    R2_BufferPoolSnapshot ownership_after;
    R2_DmaSlotsObservation observation;
    R2_DmaSlotsRebindPlan plan;
    R2_DmaSlotsSnapshot mapping_before;
    R2_DmaSlotsSnapshot mapping_after;
    W5_BlockDescriptor descriptor;
    volatile uint32_t *inactive_address_register;
    volatile uint32_t *active_address_register;
    volatile R2_W5_Trace *trace;

    if ((dma != &hdma_adc1) ||
        (g_r2_w5_result.phase != R2_W5_RUNNING))
    {
        LatchFault(R2_W5_FAULT_EVENT);
        return;
    }

    sequence = g_r2_w5_result.input_count + 1U;
    if ((sequence > R2_W5_EVENTS) ||
        ((irq_flags & DMA_LISR_TCIF0) == 0U) ||
        (irq_ct != (sequence & 1U)) ||
        (completed_slot != (irq_ct ^ 1U)))
    {
        LatchFault(R2_W5_FAULT_EVENT);
        return;
    }

    trace_for_exit = sequence - 1U;
    trace = &g_r2_w5_result.trace[trace_for_exit];
    trace->sequence = sequence;
    trace->ct_entry = irq_ct;
    trace->completed_slot = completed_slot;
    trace->replacement_id = R2_BUFFER_POOL_INVALID_ID;
    trace->m0_before = DMA2_Stream0->M0AR;
    trace->m1_before = DMA2_Stream0->M1AR;

    if ((R2_DmaSlots_ObserveCt(irq_ct, &observation) != R2_DMA_SLOTS_OK) ||
        ((uint32_t)observation.inactive_slot != completed_slot) ||
        (R2_DmaSlots_GetSnapshot(&mapping_before) != R2_DMA_SLOTS_OK) ||
        (R2_BufferPool_GetSnapshot(&ownership_before) != R2_BUFFER_POOL_OK))
    {
        LatchFault(R2_W5_FAULT_MODEL);
        return;
    }

    trace->completed_id = observation.completed_buffer;

    if (((uint32_t)observation.completed_buffer >= R2_W5_BUFFERS) ||
        ((uint32_t)observation.active_buffer >= R2_W5_BUFFERS) ||
        (DMA2_Stream0->M0AR != Address(mapping_before.m0_buffer)) ||
        (DMA2_Stream0->M1AR != Address(mapping_before.m1_buffer)) ||
        (ownership_before.states[observation.completed_buffer] !=
            R2_BUFFER_STATE_DMA_OWNED) ||
        (ownership_before.states[observation.active_buffer] !=
            R2_BUFFER_STATE_DMA_OWNED) ||
        (ownership_before.violation_count != 0U) ||
        (mapping_before.violation_count != 0U))
    {
        LatchFault(R2_W5_FAULT_MODEL);
        return;
    }

    inactive_address_register = completed_slot == 0U ?
        &DMA2_Stream0->M0AR : &DMA2_Stream0->M1AR;
    active_address_register = completed_slot == 0U ?
        &DMA2_Stream0->M1AR : &DMA2_Stream0->M0AR;
    active_address = Address(observation.active_buffer);
    nominal = sequence * R2_W5_BLOCK_CYCLES;

    free_result = xQueueReceiveFromISR(free_queue, &replacement, &hpw);
    if (hpw != pdFALSE)
    {
        irq_should_yield = pdTRUE;
    }

    if (free_result != pdPASS)
    {
        /* Controlled capacity drop: no MxAR write, no ownership transition,
         * no READY publication. The completed physical buffer remains bound
         * to the inactive hardware slot and remains DMA_OWNED. */
        trace->decision = R2_W5_DECISION_DROP;
        trace->free_depth_after_take = 0U;
        trace->ready_depth_after_publish =
            (uint32_t)uxQueueMessagesWaitingFromISR(ready_queue);

        if ((uxQueueMessagesWaitingFromISR(free_queue) != 0U) ||
            (free_token_mask != 0U))
        {
            LatchFault(R2_W5_FAULT_DROP);
            return;
        }

        primask = __get_PRIMASK();
        __disable_irq();
        __DSB();
        critical_start = DWT->CYCCNT;
        trace->ndtr_guard = DMA2_Stream0->NDTR;
        healthy = HardwareHealthy();

        if ((g_r2_w5_result.phase != R2_W5_RUNNING) ||
            (CurrentCt() != irq_ct) ||
            (*active_address_register != active_address) ||
            (*inactive_address_register != Address(observation.completed_buffer)))
        {
            LatchFault(R2_W5_FAULT_PRECHECK);
            __set_PRIMASK(primask);
            return;
        }

        now = DWT->CYCCNT;
        elapsed = now - g_r2_w5_result.epoch_before;
        if (R2_W5_CheckWindow(sequence, irq_ct, CurrentCt(), elapsed,
                trace->ndtr_guard, healthy) != R2_W5_GUARD_OK)
        {
            LatchFault(R2_W5_FAULT_PRECHECK);
            __set_PRIMASK(primask);
            return;
        }

        __DSB();
        ct_after = CurrentCt();
        now = DWT->CYCCNT;
        trace->final_window_cycles = now - critical_start;
        trace->nominal_to_decision_cycles =
            now - g_r2_w5_result.epoch_before - nominal;
        trace->m0_after = DMA2_Stream0->M0AR;
        trace->m1_after = DMA2_Stream0->M1AR;

        if ((ct_after != irq_ct) ||
            (trace->m0_after != trace->m0_before) ||
            (trace->m1_after != trace->m1_before) ||
            (*active_address_register != active_address) ||
            (*inactive_address_register != Address(observation.completed_buffer)) ||
            (HardwareHealthy() == 0U))
        {
            LatchFault(R2_W5_FAULT_DROP);
        }
        if ((trace->final_window_cycles > R2_W5_FINAL_RESERVE_CYCLES) ||
            (trace->nominal_to_decision_cycles > R2_W5_WRITE_LIMIT_CYCLES))
        {
            LatchFault(R2_W5_FAULT_TIMING);
        }

        __set_PRIMASK(primask);
        if (g_r2_w5_result.fault_bits != 0U)
        {
            return;
        }

