nkpkm2/stm32-stream-lab/firmware/acquisition/r2_w5_capacity.c
        if ((R2_DmaSlots_GetSnapshot(&mapping_after) != R2_DMA_SLOTS_OK) ||
            (R2_BufferPool_GetSnapshot(&ownership_after) != R2_BUFFER_POOL_OK) ||
            (mapping_after.mapping_epoch != mapping_before.mapping_epoch) ||
            (mapping_after.m0_buffer != mapping_before.m0_buffer) ||
            (mapping_after.m1_buffer != mapping_before.m1_buffer) ||
            (ownership_after.states[observation.completed_buffer] !=
                R2_BUFFER_STATE_DMA_OWNED) ||
            (ownership_after.states[observation.active_buffer] !=
                R2_BUFFER_STATE_DMA_OWNED) ||
            (ownership_after.violation_count != ownership_before.violation_count) ||
            (mapping_after.violation_count != mapping_before.violation_count))
        {
            LatchFault(R2_W5_FAULT_DROP);
            return;
        }

        trace->mapping_epoch_after = mapping_after.mapping_epoch;
        ++g_r2_w5_result.input_count;
        ++g_r2_w5_result.capacity_drop_count;
        ++g_r2_w5_result.dropped_by_buffer[observation.completed_buffer];
        ++g_r2_w5_result.current_drop_streak;
        if (g_r2_w5_result.current_drop_streak >
            g_r2_w5_result.max_drop_streak)
        {
            g_r2_w5_result.max_drop_streak =
                g_r2_w5_result.current_drop_streak;
        }

        if (trace->nominal_to_decision_cycles >
            g_r2_w5_result.max_nominal_to_decision_cycles)
        {
            g_r2_w5_result.max_nominal_to_decision_cycles =
                trace->nominal_to_decision_cycles;
        }
        if (trace->final_window_cycles >
            g_r2_w5_result.max_final_window_cycles)
        {
            g_r2_w5_result.max_final_window_cycles =
                trace->final_window_cycles;
        }

        if (sequence == R2_W5_EVENTS)
        {
            g_r2_w5_result.phase = R2_W5_QUIESCING;
            CLEAR_BIT(TIM2->CR1, TIM_CR1_CEN);
            __DSB();
        }
        return;
    }

    /* Admission path: consume one FREE token, write only the inactive MxAR,
     * then commit the software mapping and ownership transaction. */
    bit = BitFor(replacement);
    if ((free_token_mask & bit) == 0U)
    {
        LedgerFault();
        return;
    }
    free_token_mask &= ~bit;

    free_depth = uxQueueMessagesWaitingFromISR(free_queue);
    trace->free_depth_after_take = (uint32_t)free_depth;
    if ((uint32_t)free_depth < g_r2_w5_result.min_free_depth)
    {
        g_r2_w5_result.min_free_depth = (uint32_t)free_depth;
    }

    if ((R2_BufferPool_GetState(replacement, &replacement_owner) !=
            R2_BUFFER_POOL_OK) ||
        (replacement_owner != R2_BUFFER_STATE_FREE) ||
        (R2_DmaSlots_PrepareInactiveRebind(
            irq_ct, replacement, &plan) != R2_DMA_SLOTS_OK))
    {
        LatchFault(R2_W5_FAULT_MODEL);
        return;
    }

    trace->decision = R2_W5_DECISION_ADMIT;
    trace->replacement_id = replacement;

    primask = __get_PRIMASK();
    __disable_irq();
    __DSB();
    critical_start = DWT->CYCCNT;
    trace->ndtr_guard = DMA2_Stream0->NDTR;
    healthy = HardwareHealthy();

    if ((g_r2_w5_result.phase != R2_W5_RUNNING) ||
        (R2_DmaSlots_CheckPlanCt(&plan, CurrentCt()) != R2_DMA_SLOTS_OK) ||
        (*active_address_register != active_address) ||
        (*inactive_address_register != Address(observation.completed_buffer)))
    {
        LatchFault(R2_W5_FAULT_PRECHECK);
        __set_PRIMASK(primask);
        return;
    }

    now = DWT->CYCCNT;
    elapsed = now - g_r2_w5_result.epoch_before;
    if (R2_W5_CheckWindow(sequence, irq_ct, CurrentCt(), elapsed,
            trace->ndtr_guard, healthy) != R2_W5_GUARD_OK)
    {
        LatchFault(R2_W5_FAULT_PRECHECK);
        __set_PRIMASK(primask);
        return;
    }

    *inactive_address_register = Address(replacement);
    __DSB();
    ct_after = CurrentCt();
    now = DWT->CYCCNT;
    trace->final_window_cycles = now - critical_start;
    trace->nominal_to_decision_cycles =
        now - g_r2_w5_result.epoch_before - nominal;
    trace->m0_after = DMA2_Stream0->M0AR;
    trace->m1_after = DMA2_Stream0->M1AR;

    if ((*inactive_address_register != Address(replacement)) ||
        (*active_address_register != active_address) ||
        (ct_after != irq_ct) ||
        (HardwareHealthy() == 0U))
    {
        LatchFault(R2_W5_FAULT_ADDRESS);
    }
    if ((trace->final_window_cycles > R2_W5_FINAL_RESERVE_CYCLES) ||
        (trace->nominal_to_decision_cycles > R2_W5_WRITE_LIMIT_CYCLES))
    {
        LatchFault(R2_W5_FAULT_TIMING);
    }

    __set_PRIMASK(primask);
    if (g_r2_w5_result.fault_bits != 0U)
    {
        return;
    }

    if ((R2_DmaSlots_CommitPreparedRebind(&plan) != R2_DMA_SLOTS_OK) ||
        (R2_BufferPool_CommitDmaRotation(
            observation.completed_buffer, replacement) != R2_BUFFER_POOL_OK))
    {
        LatchFault(R2_W5_FAULT_MODEL);
        return;
    }

    descriptor.sequence = sequence;
    descriptor.buffer_id = observation.completed_buffer;
    descriptor.completed_slot = completed_slot;

    if (R2_DmaSlots_GetSnapshot(&mapping_after) != R2_DMA_SLOTS_OK)
    {
        LatchFault(R2_W5_FAULT_MODEL);
        return;
    }

    descriptor.mapping_epoch = mapping_after.mapping_epoch;
    trace->mapping_epoch_after = mapping_after.mapping_epoch;

    bit = BitFor(descriptor.buffer_id);
    if ((ready_token_mask & bit) != 0U)
    {
        LedgerFault();
        return;
    }

    hpw = pdFALSE;
    if (xQueueSendFromISR(ready_queue, &descriptor, &hpw) != pdPASS)
    {
        ++g_r2_w5_result.ready_send_fail_count;
        LatchFault(R2_W5_FAULT_READY_FULL);
        return;
    }
    ready_token_mask |= bit;
    if (hpw != pdFALSE)
    {
        irq_should_yield = pdTRUE;
    }

    ready_depth = uxQueueMessagesWaitingFromISR(ready_queue);
    trace->ready_depth_after_publish = (uint32_t)ready_depth;
    if ((uint32_t)ready_depth > g_r2_w5_result.max_ready_depth)
    {
        g_r2_w5_result.max_ready_depth = (uint32_t)ready_depth;
    }

    hpw = pdFALSE;
    if (xTaskNotifyFromISR(processing_task_handle, W5_WORK_BIT,
            eSetBits, &hpw) != pdPASS)
    {
        ++g_r2_w5_result.notification_fail_count;
        LatchFault(R2_W5_FAULT_EVENT);
        return;
    }
    if (hpw != pdFALSE)
    {
        irq_should_yield = pdTRUE;
    }

    ++g_r2_w5_result.input_count;
    ++g_r2_w5_result.admitted_count;
    ++g_r2_w5_result.admitted_by_buffer[descriptor.buffer_id];

    if (g_r2_w5_result.current_drop_streak != 0U)
    {
        ++g_r2_w5_result.recovered_admission_after_drop_count;
        g_r2_w5_result.current_drop_streak = 0U;
    }

    if (trace->nominal_to_decision_cycles >
        g_r2_w5_result.max_nominal_to_decision_cycles)
    {
        g_r2_w5_result.max_nominal_to_decision_cycles =
            trace->nominal_to_decision_cycles;
    }
    if (trace->final_window_cycles >
        g_r2_w5_result.max_final_window_cycles)
    {
        g_r2_w5_result.max_final_window_cycles =
            trace->final_window_cycles;
    }

    if ((R2_BufferPool_GetSnapshot(&ownership_after) != R2_BUFFER_POOL_OK) ||
        (ownership_after.states[mapping_after.m0_buffer] !=
            R2_BUFFER_STATE_DMA_OWNED) ||
        (ownership_after.states[mapping_after.m1_buffer] !=
            R2_BUFFER_STATE_DMA_OWNED) ||
        (ownership_after.violation_count != 0U) ||
        (mapping_after.violation_count != 0U))
    {
        LatchFault(R2_W5_FAULT_MODEL);
        return;
    }

    if (sequence == R2_W5_EVENTS)
    {
        g_r2_w5_result.phase = R2_W5_QUIESCING;
        CLEAR_BIT(TIM2->CR1, TIM_CR1_CEN);
        __DSB();
    }
}

