nkpkm2/stm32-stream-lab/firmware/acquisition/r2_w5_capacity.c
    taskENTER_CRITICAL();
    if (((ready_token_mask & bit) == 0U) ||
        (R2_BufferPool_GetState((R2_BufferId)id, &state) !=
            R2_BUFFER_POOL_OK) ||
        (state != R2_BUFFER_STATE_READY) ||
        (R2_BufferPool_ClaimReady((R2_BufferId)id) != R2_BUFFER_POOL_OK))
    {
        taskEXIT_CRITICAL();
        LatchFault(R2_W5_FAULT_PROCESSING);
        return;
    }
    ready_token_mask &= ~bit;
    taskEXIT_CRITICAL();

    trace->processing_begin_offset_cycles =
        DWT->CYCCNT - g_r2_w5_result.epoch_before;

    /* Deliberately hold the current buffer in PROCESSING long enough to
     * exhaust K=1 and force several consecutive DMA capacity drops. The
     * task remains preemptible by DMA and kernel interrupts. */
    begin = DWT->CYCCNT;
    while ((uint32_t)(DWT->CYCCNT - begin) < R2_W5_PROCESS_HOLD_CYCLES)
    {
        __NOP();
    }

    if ((buffers[id].guard_lo != W5_GUARD_LO) ||
        (buffers[id].guard_hi != W5_GUARD_HI))
    {
        ++g_r2_w5_result.canary_errors;
        LatchFault(R2_W5_FAULT_SAMPLES);
        return;
    }

    for (j = 0U; j < R2_W5_BLOCK_SAMPLES; ++j)
    {
        uint32_t value = buffers[id].samples[j];
        if (value > 4095U)
        {
            ++g_r2_w5_result.sample_errors;
        }
        else
        {
            ++g_r2_w5_result.full_sample_count;
        }
        if (value < min_value)
        {
            min_value = value;
        }
        if (value > max_value)
        {
            max_value = value;
        }
    }

    trace->raw_min = min_value;
    trace->raw_max = max_value;
    trace->processing_end_offset_cycles =
        DWT->CYCCNT - g_r2_w5_result.epoch_before;

    if (g_r2_w5_result.sample_errors != 0U)
    {
        LatchFault(R2_W5_FAULT_SAMPLES);
        return;
    }

    if (SendFreeToken(W5_FREE_SEND_COMPLETE,
            (R2_BufferId)id, sequence) != pdPASS)
    {
        LatchFault(R2_W5_FAULT_RELEASE);
        return;
    }

    ++g_r2_w5_result.processed_count;
    ++g_r2_w5_result.released_count;
    ++g_r2_w5_result.processed_by_buffer[id];
    ++g_r2_w5_result.released_by_buffer[id];
    trace->processed_ok = 1U;
}

static void ProcessingTask(void *argument)
{
    uint32_t notification_value;
    W5_BlockDescriptor descriptor;
    (void)argument;

    for (;;)
    {
        notification_value = 0U;
        (void)xTaskNotifyWait(0U, UINT32_MAX,
            &notification_value, portMAX_DELAY);

        if ((notification_value & W5_WORK_BIT) != 0U)
        {
            while (xQueueReceive(ready_queue, &descriptor, 0U) == pdPASS)
            {
                ProcessDescriptor(&descriptor);
                if (g_r2_w5_result.fault_bits != 0U)
                {
                    break;
                }
            }
        }
    }
}

static void Finalize(void)
{
    R2_BufferPoolSnapshot pool;
    R2_DmaSlotsSnapshot slots;
    uint32_t expected_free_mask = 0U;
    uint32_t dropped_sum = 0U;
    uint32_t id;

    if ((R2_BufferPool_GetSnapshot(&pool) != R2_BUFFER_POOL_OK) ||
        (R2_DmaSlots_GetSnapshot(&slots) != R2_DMA_SLOTS_OK))
    {
        LatchFault(R2_W5_FAULT_MODEL);
        return;
    }

    g_r2_w5_result.pool_at_stop = pool;
    g_r2_w5_result.slots_at_stop = slots;
    g_r2_w5_result.free_queue_depth_final =
        (uint32_t)uxQueueMessagesWaiting(free_queue);
    g_r2_w5_result.ready_queue_depth_final =
        (uint32_t)uxQueueMessagesWaiting(ready_queue);
    g_r2_w5_result.free_token_mask_final = free_token_mask;
    g_r2_w5_result.ready_token_mask_final = ready_token_mask;

    for (id = 0U; id < R2_W5_BUFFERS; ++id)
    {
        if ((buffers[id].guard_lo != W5_GUARD_LO) ||
            (buffers[id].guard_hi != W5_GUARD_HI))
        {
            ++g_r2_w5_result.canary_errors;
        }

        if (pool.states[id] == R2_BUFFER_STATE_FREE)
        {
            expected_free_mask |= 1UL << id;
        }

        if ((g_r2_w5_result.admitted_by_buffer[id] !=
                g_r2_w5_result.processed_by_buffer[id]) ||
            (g_r2_w5_result.admitted_by_buffer[id] !=
                g_r2_w5_result.released_by_buffer[id]))
        {
            LatchFault(R2_W5_FAULT_PROCESSING);
        }

        dropped_sum += g_r2_w5_result.dropped_by_buffer[id];
    }

    if ((pool.k != R2_W5_K) ||
        (pool.active_count != R2_W5_BUFFERS) ||
        (pool.free_count != R2_W5_K) ||
        (pool.ready_count != 0U) ||
        (pool.processing_count != 0U) ||
        (pool.dma_owned_count != 2U) ||
        (pool.violation_count != 0U) ||
        (slots.violation_count != 0U) ||
        (slots.m0_buffer == slots.m1_buffer) ||
        (pool.states[slots.m0_buffer] != R2_BUFFER_STATE_DMA_OWNED) ||
        (pool.states[slots.m1_buffer] != R2_BUFFER_STATE_DMA_OWNED) ||
        (g_r2_w5_result.free_queue_depth_final != R2_W5_K) ||
        (g_r2_w5_result.ready_queue_depth_final != 0U) ||
        (ready_token_mask != 0U) ||
        (free_token_mask != expected_free_mask) ||
        ((free_token_mask | BitFor(slots.m0_buffer) |
          BitFor(slots.m1_buffer)) != W5_ALL_BUFFER_MASK))
    {
        LatchFault(R2_W5_FAULT_MODEL);
    }

    if ((g_r2_w5_result.input_count != R2_W5_EVENTS) ||
        ((g_r2_w5_result.admitted_count +
          g_r2_w5_result.capacity_drop_count) != R2_W5_EVENTS) ||
        (g_r2_w5_result.admitted_count < R2_W5_MIN_ADMISSIONS) ||
        (g_r2_w5_result.capacity_drop_count < R2_W5_MIN_CAPACITY_DROPS) ||
        (g_r2_w5_result.max_drop_streak < R2_W5_MIN_DROP_STREAK) ||
        (g_r2_w5_result.recovered_admission_after_drop_count <
            R2_W5_MIN_RECOVERIES) ||
        (g_r2_w5_result.processed_count != g_r2_w5_result.admitted_count) ||
        (g_r2_w5_result.released_count != g_r2_w5_result.admitted_count) ||
        (g_r2_w5_result.completion_hook_count != g_r2_w5_result.admitted_count) ||
        (g_r2_w5_result.init_hook_count != R2_W5_K) ||
        (g_r2_w5_result.illegal_free_send_count != 0U) ||
        (g_r2_w5_result.ready_send_fail_count != 0U) ||
        (g_r2_w5_result.notification_fail_count != 0U) ||
        (g_r2_w5_result.token_ledger_errors != 0U) ||
        (g_r2_w5_result.dma_error_flags_seen != 0U) ||
        (g_r2_w5_result.adc_ovr_seen != 0U) ||
        (g_r2_w5_result.full_sample_count !=
            g_r2_w5_result.admitted_count * R2_W5_BLOCK_SAMPLES) ||
        (g_r2_w5_result.sample_errors != 0U) ||
        (g_r2_w5_result.canary_errors != 0U) ||
        (dropped_sum != g_r2_w5_result.capacity_drop_count))
    {
        LatchFault(R2_W5_FAULT_EVENT);
    }
}

static void ControlTask(void *argument)
{
    uint32_t id;
    uint32_t j;
    TickType_t start_tick;
    TickType_t drain_tick;
    HAL_StatusTypeDef status;
    (void)argument;

    vTaskDelay(pdMS_TO_TICKS(100U));

