nkpkm2/stm32-stream-lab/firmware/acquisition/r2_w5_capacity.c
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    g_r2_w5_result.system_core_clock = SystemCoreClock;
    g_r2_w5_result.aircr = SCB->AIRCR;
    g_r2_w5_result.min_free_depth = R2_W5_K;

    for (id = 0U; id < R2_W5_BUFFERS; ++id)
    {
        buffers[id].guard_lo = W5_GUARD_LO;
        buffers[id].guard_hi = W5_GUARD_HI;
        for (j = 0U; j < R2_W5_BLOCK_SAMPLES; ++j)
        {
            buffers[id].samples[j] = W5_SENTINEL;
        }
        g_r2_w5_result.buffer_address[id] = Address(id);
    }

    if (!ConfigurationValid())
    {
        LatchFault(R2_W5_FAULT_CONFIG);
        g_r2_w5_result.phase = R2_W5_FAILED;
    }
    else
    {
        status = Start();
        g_r2_w5_result.start_status = (uint32_t)status;
        if (status != HAL_OK)
        {
            LatchFault(R2_W5_FAULT_START);
        }

        start_tick = xTaskGetTickCount();
        while (g_r2_w5_result.phase == R2_W5_RUNNING)
        {
            if ((TickType_t)(xTaskGetTickCount() - start_tick) >=
                pdMS_TO_TICKS(W5_RUN_TIMEOUT_MS))
            {
                LatchFault(R2_W5_FAULT_TIMEOUT);
                break;
            }
            vTaskDelay(pdMS_TO_TICKS(1U));
        }

        status = Stop();
        g_r2_w5_result.stop_status = (uint32_t)status;
        if ((status != HAL_OK) ||
            ((DMA2_Stream0->CR & DMA_SxCR_EN) != 0U) ||
            ((TIM2->CR1 & TIM_CR1_CEN) != 0U) ||
            ((ADC1->CR2 & (ADC_CR2_ADON | ADC_CR2_DMA)) != 0U))
        {
            LatchFault(R2_W5_FAULT_STOP);
        }

        drain_tick = xTaskGetTickCount();
        while ((g_r2_w5_result.processed_count !=
                g_r2_w5_result.admitted_count) &&
               (g_r2_w5_result.fault_bits == 0U))
        {
            if ((TickType_t)(xTaskGetTickCount() - drain_tick) >=
                pdMS_TO_TICKS(W5_DRAIN_TIMEOUT_MS))
            {
                LatchFault(R2_W5_FAULT_TIMEOUT);
                break;
            }
            (void)xTaskNotify(processing_task_handle,
                W5_WORK_BIT, eSetBits);
            vTaskDelay(pdMS_TO_TICKS(1U));
        }

        if (g_r2_w5_result.fault_bits == 0U)
        {
            uint32_t irq_before = g_r2_w5_result.irq_count;
            uint32_t input_before = g_r2_w5_result.input_count;
            uint32_t admitted_before = g_r2_w5_result.admitted_count;
            uint32_t drop_before = g_r2_w5_result.capacity_drop_count;
            uint32_t processed_before = g_r2_w5_result.processed_count;

            vTaskDelay(pdMS_TO_TICKS(2U));

            g_r2_w5_result.quiet_irq_count = g_r2_w5_result.irq_count;
            g_r2_w5_result.quiet_input_count = g_r2_w5_result.input_count;
            g_r2_w5_result.quiet_admitted_count =
                g_r2_w5_result.admitted_count;
            g_r2_w5_result.quiet_drop_count =
                g_r2_w5_result.capacity_drop_count;
            g_r2_w5_result.quiet_processed_count =
                g_r2_w5_result.processed_count;

            if ((irq_before != g_r2_w5_result.irq_count) ||
                (input_before != g_r2_w5_result.input_count) ||
                (admitted_before != g_r2_w5_result.admitted_count) ||
                (drop_before != g_r2_w5_result.capacity_drop_count) ||
                (processed_before != g_r2_w5_result.processed_count))
            {
                LatchFault(R2_W5_FAULT_EVENT);
            }
        }

        if (g_r2_w5_result.fault_bits == 0U)
        {
            Finalize();
        }

        g_r2_w5_result.test_pass =
            g_r2_w5_result.fault_bits == 0U ? 1U : 0U;
        g_r2_w5_result.phase =
            g_r2_w5_result.test_pass != 0U ?
            R2_W5_COMPLETE : R2_W5_FAILED;
    }

    for (;;)
    {
        vTaskDelay(pdMS_TO_TICKS(1000U));
    }
}

void R2_W5_CreateTasks(void)
{
    TaskHandle_t control_handle;
    uint32_t id;

    g_r2_w5_result.magic = W5_MAGIC;
    g_r2_w5_result.start_status = UINT32_MAX;
    g_r2_w5_result.stop_status = UINT32_MAX;
    g_r2_w5_result.phase = R2_W5_RESET;

    free_queue = xQueueCreateStatic(
        R2_W5_K,
        sizeof(R2_BufferId),
        free_queue_storage,
        &free_queue_control);

    ready_queue = xQueueCreateStatic(
        R2_W5_K,
        sizeof(W5_BlockDescriptor),
        ready_queue_storage,
        &ready_queue_control);

    if ((free_queue == NULL) || (ready_queue == NULL))
    {
        g_r2_w5_result.fault_bits = R2_W5_FAULT_CONFIG;
        g_r2_w5_result.phase = R2_W5_FAILED;
        return;
    }

    vQueueAddToRegistry(free_queue, "R2Free");
    vQueueAddToRegistry(ready_queue, "R2Ready");

    R2_BufferPool_Reset();
    R2_DmaSlots_Reset();

    if ((R2_BufferPool_Activate(R2_W5_K) != R2_BUFFER_POOL_OK) ||
        (R2_DmaSlots_Initialize((R2_BufferId)0U,
            (R2_BufferId)1U) != R2_DMA_SLOTS_OK))
    {
        g_r2_w5_result.fault_bits = R2_W5_FAULT_CONFIG;
        g_r2_w5_result.phase = R2_W5_FAILED;
        return;
    }

    free_token_mask = 0U;
    ready_token_mask = 0U;
    free_send_context.active = 0U;
    free_send_context.source = W5_FREE_SEND_NONE;
    free_send_context.buffer_id = R2_BUFFER_POOL_INVALID_ID;

    for (id = 2U; id < R2_W5_BUFFERS; ++id)
    {
        if (SendFreeToken(W5_FREE_SEND_INIT, (R2_BufferId)id, 0U) != pdPASS)
        {
            g_r2_w5_result.phase = R2_W5_FAILED;
            return;
        }
    }

    if ((uxQueueMessagesWaiting(free_queue) != R2_W5_K) ||
        (free_token_mask != (W5_ALL_BUFFER_MASK & ~0x3UL)))
    {
        g_r2_w5_result.fault_bits |= R2_W5_FAULT_TOKEN_LEDGER;
        g_r2_w5_result.phase = R2_W5_FAILED;
        return;
    }

    processing_task_handle = xTaskCreateStatic(
        ProcessingTask,
        "R2W5Proc",
        W5_PROCESS_STACK_WORDS,
        NULL,
        tskIDLE_PRIORITY + 3U,
        processing_task_stack,
        &processing_task_control);

    control_handle = xTaskCreateStatic(
        ControlTask,
        "R2W5Ctl",
        W5_CONTROL_STACK_WORDS,
        NULL,
        tskIDLE_PRIORITY + 2U,
        control_task_stack,
        &control_task_control);

    g_r2_w5_result.processing_task_created =
        processing_task_handle != NULL ? 1U : 0U;
    g_r2_w5_result.control_task_created =
        control_handle != NULL ? 1U : 0U;

    if ((processing_task_handle == NULL) || (control_handle == NULL))
    {
        g_r2_w5_result.fault_bits |= R2_W5_FAULT_START;
        g_r2_w5_result.phase = R2_W5_FAILED;
        return;
    }

    g_r2_w5_result.phase = R2_W5_TASKS_CREATED;
}
